app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? ORDER BY "articles"."id" ASC LIMIT 1  [["id", 1]]
---
  def show
    @article = Article.find(params[:id])